functionProcessor/testCase1/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         |                                                |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           |                                                |
|    \\/     M anipulation  |                                                |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    location    "system";
    object      decomposeParDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  4;
method          manual;

manualCoeffs
{
    dataFile    "cellDecomposition";
}

// ************************************************************************* //
